<a href="https://colab.research.google.com/github/hyunjay-dev/dataAnalysis/blob/main/day02_pandas03_NaNData.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## DataFrame - 누락데이터 관리

### dropna()

- 데이터를 살펴보면 값이 없는 경우가 있다. 이런 경우 Missing Value 라고 한다.

- Missing Value를 발견하면 처리하는 전략들이 있다.
1. 데이타가 거의 없는 feature 는 feature 자체를 drop 한다.
2. 데이타가 없으면 drop
3. 데이타의 최소 갯수에 못 미치면 drop
4. 데이타가 없으면 최빈값 | 평균값 | ‘0’ 등등의 값으로 데이타를 채운다. 

> 판다스에서는 누락된 데이타를 모두 NaN으로 처리한다. 판다스 객체의 모든 통계는 누락된 데이타를 배제하고 처리한다.

- dropna() : NaN값이 하나라도 있으면 해당하는 row를 전부 삭제
- dropna(how=‘all’) : 모든 값이 NaN이면 삭제
- dropna(thresh=3) : 누락 데이터가 3개 초과로 들어가면 그때는 다 삭제
- dropna(how=‘any’) : default 

- fillna(), isnull(), notnull()

In [1]:
from numpy import nan as NA
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [2]:
df = DataFrame([[1,6,5,3],[1,NA,NA],[NA,NA,NA],[NA,6.5,3]])
df

     0    1    2    3
0  1.0  6.0  5.0  3.0
1  1.0  NaN  NaN  NaN
2  NaN  NaN  NaN  NaN
3  NaN  6.5  3.0  NaN

In [3]:
removeNa = df.dropna(how='any')
removeNa

     0    1    2    3
0  1.0  6.0  5.0  3.0

In [10]:
df.dropna(how='all')

     0    1    2    3
0  1.0  6.0  5.0  3.0
1  1.0  NaN  NaN  NaN
3  NaN  6.5  3.0  NaN

In [12]:
df.dropna(thresh=2)
# df

     0    1    2    3
0  1.0  6.0  5.0  3.0
3  NaN  6.5  3.0  NaN

### fillna()

In [ ]:
df.fillna(0)

     0    1    2    3
0  1.0  6.0  5.0  3.0
1  1.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
3  0.0  6.5  3.0  0.0

In [ ]:
df.fillna(df.mean())

     0     1    2    3
0  1.0  6.00  5.0  3.0
1  1.0  6.25  4.0  3.0
2  1.0  6.25  4.0  3.0
3  1.0  6.50  3.0  3.0

In [ ]:
df.fillna(value=7)

     0    1    2    3
0  1.0  6.0  5.0  3.0
1  1.0  7.0  7.0  7.0
2  7.0  7.0  7.0  7.0
3  7.0  6.5  3.0  7.0

In [ ]:
df

     0    1    2    3
0  1.0  6.0  5.0  3.0
1  1.0  NaN  NaN  NaN
2  NaN  NaN  NaN  NaN
3  NaN  6.5  3.0  NaN

In [ ]:
# 누락된 데이터의 바로 위 데이터값으로 누락된 데이터를 채워줌
df.fillna(method='ffill')

     0    1    2    3
0  1.0  6.0  5.0  3.0
1  1.0  6.0  5.0  3.0
2  1.0  6.0  5.0  3.0
3  1.0  6.5  3.0  3.0

## DataFrame - 데이터 병합(Absorption)

### pd.concat(['variableName','variableName'])

- important things
  - (default) axis = 0 ::
  - (default) join = 'outer' :: 다 합쳐줌
  - ignore_index = True :: 인덱스값 통일
  - keys=['A':'B':..] :: similar grouping :: common using display data source

In [ ]:
# data 병합
df1 = DataFrame({
                    'A' : ['A0','A1','A2','A3'],
                    'B' : ['B0','B1','B2','B3'],
                    'C' : ['C0','C1','C2','C3'],
                    'D' : ['D0','D1','D2','D3'],
                })

In [ ]:
df2 = DataFrame({
                    'A' : ['A4','A5','A6','A7'],
                    'B' : ['B4','B5','B6','B7'],
                    'C' : ['C4','C5','C6','C7'],
                    'D' : ['D4','D5','D6','D7'],
                })

In [ ]:
result = pd.concat([df1, df2], ignore_index=True)
result

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [ ]:
# left-right Absorption
result = pd.concat([df1, df2], axis=1, ignore_index=True)
result

    0   1   2   3   4   5   6   7
0  A0  B0  C0  D0  A4  B4  C4  D4
1  A1  B1  C1  D1  A5  B5  C5  D5
2  A2  B2  C2  D2  A6  B6  C6  D6
3  A3  B3  C3  D3  A7  B7  C7  D7

### keys =['', '']

In [ ]:
# grouping = 데이터의 출처와 연관지어 줌
result=pd.concat([df1, df2], keys=['X','Y'])
result

      A   B   C   D
X 0  A0  B0  C0  D0
  1  A1  B1  C1  D1
  2  A2  B2  C2  D2
  3  A3  B3  C3  D3
Y 0  A4  B4  C4  D4
  1  A5  B5  C5  D5
  2  A6  B6  C6  D6
  3  A7  B7  C7  D7

In [ ]:
df3 = DataFrame({
                    'A' : ['A0','A1','A2','A3'],
                    'B' : ['B0','B1','B2','B3'],
                    'C' : ['C0','C1','C2','C3']
                })

In [ ]:
df4 = DataFrame({
                    'A' : ['A4','A5','A6','A7'],
                    'B' : ['B4','B5','B6','B7'],
                    'C' : ['C4','C5','C6','C7'],
                    'D' : ['D4','D5','D6','D7'],
                })

In [ ]:
result2 = pd.concat([df3,df4], ignore_index=True)
result2

    A   B   C    D
0  A0  B0  C0  NaN
1  A1  B1  C1  NaN
2  A2  B2  C2  NaN
3  A3  B3  C3  NaN
4  A4  B4  C4   D4
5  A5  B5  C5   D5
6  A6  B6  C6   D6
7  A7  B7  C7   D7

### join ='outer' | 'inner' 

- inner :: 둘 다 모두 존재하는 공통적인 컬럼값 인덱스만 가져 온다.
- outer :: (default 값) 그냥 다 합친다.

> 반대는 merge

In [ ]:
result3 = pd.concat([df3, df4], join='outer')
result3

    A   B   C    D
0  A0  B0  C0  NaN
1  A1  B1  C1  NaN
2  A2  B2  C2  NaN
3  A3  B3  C3  NaN
0  A4  B4  C4   D4
1  A5  B5  C5   D5
2  A6  B6  C6   D6
3  A7  B7  C7   D7

In [ ]:
result3 = pd.concat([df3, df4], join='inner')
result3

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
0  A4  B4  C4
1  A5  B5  C5
2  A6  B6  C6
3  A7  B7  C7

### pd.merge()

- 꺽쇠를 쓰지 않는다. '[' x ']'
  - how :: (default) inner
  - on :: 가장 중요한 옵션 

- 좌우 병합, 중복표기 안된다.

In [24]:
df1 = DataFrame({ 'Year':[2001,2002,2003,2004],
                  'Product_Code':[11,22,33,44],
                  'Price':[10000,20000,30000,40000]},
                   index=list('1234'))
df1

df2 = DataFrame({ 'Year':[2001,2002,2003,2004],
                  'Product_Code':[11,22,33,44],
                  'Price':[10000,20000,30000,40000]},
                   index=list('5678'))
df2

df3 = DataFrame({ 'Year':[2001,2003,2004,2005],
                  'Product_Code':[11,22,33,44],
                  'Color_num':[33,44,55,99]},
                   index=list('1234'))
df3

   Year  Product_Code  Color_num
1  2001            11         33
2  2003            22         44
3  2004            33         55
4  2005            44         99

In [27]:
# result = pd.concat([df1, df2])
# result

result = pd.merge(df1, df2) # 중복되는 컬럼과 값만 표시
# result = pd.merge(df1, df3)
result

   Year  Product_Code  Price
0  2001            11  10000
1  2002            22  20000
2  2003            33  30000
3  2004            44  40000

#### pd.merge(left, right, on='')

In [28]:
df1_1 = DataFrame({ 'Year':[2001,2002,2003,2004],
                  'Product_Code':[11,22,33,44],
                  'Price':[1,2,3,4]},
                   index=list('1234'))
# merge() 할 때는 특정한 컬럼을기준으로병합. 어떠한 칼럼을기준으로 병합하겠다는 기준을 세워야한다. 
result = pd.merge(df1, df1_1, on='Year')
result

   Year  Product_Code_x  Price_x  Product_Code_y  Price_y
0  2001              11    10000              11        1
1  2002              22    20000              22        2
2  2003              33    30000              33        3
3  2004              44    40000              44        4

In [29]:
#  기준이 되는 컬럼을 2개 result=pd.merge(df1, df1_1, on='Year')로 되는가 ?
result2 = pd.merge(df1, df1_1, on = ['Year', 'Product_Code'])
result2

   Year  Product_Code  Price_x  Price_y
0  2001            11    10000        1
1  2002            22    20000        2
2  2003            33    30000        3
3  2004            44    40000        4

#### pd.merge(left, right, on='', how='')

In [44]:
df1

   Year  Product_Code  Price
1  2001            11  10000
2  2002            22  20000
3  2003            33  30000
4  2004            44  40000

In [38]:
df3

   Year  Product_Code  Color_num
1  2001            11         33
2  2003            22         44
3  2004            33         55
4  2005            44         99

In [39]:
result3 = pd.merge(df1, df3, on='Year')
result3

   Year  Product_Code_x  Price  Product_Code_y  Color_num
0  2001              11  10000              11         33
1  2003              33  30000              22         44
2  2004              44  40000              33         55

In [40]:
result4 = pd.merge(df1, df3, on='Year', how='outer')
result4

   Year  Product_Code_x    Price  Product_Code_y  Color_num
0  2001            11.0  10000.0            11.0       33.0
1  2002            22.0  20000.0             NaN        NaN
2  2003            33.0  30000.0            22.0       44.0
3  2004            44.0  40000.0            33.0       55.0
4  2005             NaN      NaN            44.0       99.0

In [41]:
result5 = pd.merge(df1, df3, on='Year', how='inner')
result5

   Year  Product_Code_x  Price  Product_Code_y  Color_num
0  2001              11  10000              11         33
1  2003              33  30000              22         44
2  2004              44  40000              33         55

In [42]:
# how='inner', 'outer', 'left', 'right'
# df1 의 'Year'를 기준으로 병합
result6 = pd.merge(df1, df3, on='Year', how='left')
result6

   Year  Product_Code_x  Price  Product_Code_y  Color_num
0  2001              11  10000            11.0       33.0
1  2002              22  20000             NaN        NaN
2  2003              33  30000            22.0       44.0
3  2004              44  40000            33.0       55.0

In [43]:
result7 = pd.merge(df1, df3, on='Year', how='right')
result7

   Year  Product_Code_x    Price  Product_Code_y  Color_num
0  2001            11.0  10000.0              11         33
1  2003            33.0  30000.0              22         44
2  2004            44.0  40000.0              33         55
3  2005             NaN      NaN              44         99

## .set_index(cols, inplace=True)

In [36]:
# 반드시 컬럼중에하나를 인덱싱으로 뽑아낸다. 그 자리에 2001, 2002, 2003 으로 바꿔준다. :: set_index
result2.set_index('Year', inplace=True)
result2

KeyError: ignored